from django.core.management.base import BaseCommand
from admin_website.models import *
from phonenumber_field.phonenumber import PhoneNumber


class Command(BaseCommand):
    def handle(self, *args, **options):
        if not MainPage.objects.exists():
            main_page = MainPage.objects.create(
                image1="static_kit/website/main_page/1.jpg",
                image2="static_kit/website/main_page/2.jpg",
                image3="static_kit/website/main_page/3.jpg",
                text="Житловий комплекс 'NORD' розташований на березі Чорного моря в мальовничому районі Одеси. "
                "Оригінальна архітектура комплексу робить його унікальним об'єктом не тільки для Одеси, "
                "а й для всієї України - будинок прекрасно вписується в архітектуру берега і відкриває"
                " свої мешканцям і гостям чудовий вид на безкрає море. Яскравою перевагою"
                " житлового комплексу є його "
                "місцерозташування - зручна транспортна розв'язка, соціальна інфраструктура, парк і прекрасне "
                "морське повітря створюють усі умови для комфортного проживання.",
                title="Home24",
                show_app_urls=True,
                seo=Seo.objects.create(
                    title="Головна сторінка",
                    description="Головна сторінка",
                    keywords="Home24",
                ),
            )
            block_titles = [
                "Магазини, Банки, Школи",
                "Ресторани та Кафе",
                "Пляж",
                "Спортивний Комплекс",
                "Клубне Життя",
                "Зручна транспортна розв'язка",
            ]
            block_descriptions = [
                "Район розташування житлового комплексу має всю необхідну для проживання "
                "соціальну інфраструктуру - у безпосередній близькості знаходяться "
                "лікувально-профілактичні заклади, аптеки, магазини, відділення банків, "
                "приватні та комерційні дитячі садки, школи",
                "У безпосередній близькості від житлового комплексу розташовані рибний ресторан і "
                "італійська піцерія. Крім того, лише за десять хвилин ходьби від комплексу "
                "знаходяться ресторани іспанської, італійської, американської, української та російської "
                "кухні, піцерії, кафе і лаунж-бари на будь-який смак. ",
                "Житловий комплекс розташований на березі Чорного моря в районі Аркадія. У десяти "
                "хвилинах ходьби від нього знаходиться знамениті пляжі Аркадія і Чайка, а трохи далі - "
                "пляжі Курортний, 13-та станція Великого Фонтану, Пляжник та інші знамениті пляжі "
                "Одеси!",
                "Лише за 5 хвилин ходьби від житлового комплексу знаходиться Спортивний комплекс "
                "Міжнародного гуманітарного університету - це сучасний обладнаний комплекс "
                "із залами для проведення волейбольних змагань, змагань із танців і боротьби "
                "та інших спортивних заходів!",
                "Район розташування житлового комплексу Аркадія є культовим місцем нічного "
                "відпочинку та розваг - буквально за 5-10 хвилин ходьби від комплексу знаходяться "
                "такі місця зосередження клубного життя країни!",
                "ЖК розташована на березі Чорного моря в районі Аркадії та має зручну "
                "транспортну розв'язку, що дає змогу навіть у годину Пік швидко та без проблем доїхати в "
                "протягом десяти хвилин до центру міста або виїхати на автостради Одеської обл!",
            ]
            for index, (title, description) in enumerate(
                zip(block_titles, block_descriptions)
            ):
                Block.objects.create(
                    title=title,
                    description=description,
                    main_page=main_page,
                    image=f"static_kit/website/main_page/blocks/{index + 1}.jpeg",
                )
        if not ContactPage.objects.exists():
            ContactPage.objects.create(
                title="Tsaryk V.U",
                phone=PhoneNumber.from_string("+38 (073) 111-24-48", region="UA"),
                text="<p>Розробником системи <i><strong>'Home24'</strong></i> є<strong>"
                "Vladyslav Tsaryk</strong>",
                site_url="#",
                full_name="Vladyslav Tsaryk",
                location="вулиця Шевченка, 95, Чернігів, Чернігівська область, 14027",
                address="Чернігів",
                email="vladislavcarik2014@gmail.com",
                map_code='<div class="map"><iframe src="https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d805.'
                "1604051146494!2d31.33517562399743!3d51.5048829406694!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x"
                "46d54850f1c44357%3A0x6a2bc37e2c9b9fa4!2z0J3QsNGG0ZbQvtC90LDQu9GM0L3QuNC5INGD0L3RltCy0LXRgNG"
                "B0LjRgtC10YIgwqvQp9C10YDQvdGW0LPRltCy0YHRjNC60LAg0J_QvtC70ZbRgtC10YXQvdGW0LrQsMK7!5e0!3m2!1sr"
                'u!2sua!4v1679919079685!5m2!1sru!2sua" width="600" height="450" style="border:0;"'
                ' allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade">'
                "</iframe></div>",
                seo=Seo.objects.create(
                    title="Контакти",
                    description="Контакти",
                    keywords="Home24, Контакти",
                ),
            )
        if not ServicePage.objects.exists():
            service_page = ServicePage.objects.create(
                seo=Seo.objects.create(
                    title="Услуги",
                    description="Услуги",
                    keywords="Home24, Будинок24, Услуги",
                )
            )
            service_texts = [
                "<p>Прибирання та підтримання порядку на території житлового комплексу,"
                " включаючи прибирання сходових кліток, під'їздів та внутрішніх дворів."
                "</p><ul><li>Регулярне прибирання внутрішніх дворів та прибудинкових територій"
                " житлового комплексу.</li><li>Очистка сміттєвих"
                "контейнерів та територій біля них.</li><li>Прибирання сходових"
                " кліток та під'їздів будівель,"
                "включаючи миття стін та підлоги, прибирання сміття, пилу та сторонніх"
                "Предметів.</li><li>Підтримка порядку та чистоти на громадських територіях, "
                "включаючи паркування, дитячі майданчики, лавки, фонтани і т.д.</li></ul>",
                "<p>Обслуговування системи кондиціювання та вентиляції у житлових квартирах, включаючи "
                "регулярне чищення фільтрів та проведення необхідного технічного"
                "обслуговування.</p><ul><li>Регулярна перевірка та обслуговування систем кондиціювання"
                "повітря та вентиляції в житлових квартирах.</li><li>Проведення необхідних технічних робіт"
                "з обслуговування систем кондиціювання та вентиляції у житлових"
                "квартирах.</li><li>Регулярна заміна та чищення фільтрів систем кондиціювання та "
                "вентиляції в житлових квартирах.</li><li>Цілодобове оперативне реагування на "
                "можливі поломки та збої в роботі систем кондиціювання та вентиляції в житлових"
                "квартирах.</li></ul>",
                "<p>Обслуговування паркування, включаючи підтримку функціонування інженерних мереж,"
                "системи виїзду-в'їзду та пропускного режиму, а також охорону та забезпечення безпеки"
                "мешканців та автомобілів на парковці.</p><ul><li>Регулярна перевірка та обслуговування"
                "інженерних мереж паркінгу.</li><li>Підтримка працездатності системи виїзду-в'їзду"
                "на паркування та системи пропускного режиму для в'їзду на територію"
                "парковки.</li><li>Організація та здійснення системи охорони та забезпечення безпеки"
                "жителів та автомобілів на парковці.</li><li>Встановлення та обслуговування систем відео"
                "спостереження, контролю доступу та сигналізації на парковці.</li></ul>",
            ]
            service_titles = [
                "Прибирання території",
                "Обслуговування системи кондиціювання та вентиляції",
                "Обслуговування паркування",
            ]
            for index, (service_text, service_title) in enumerate(
                zip(service_texts, service_titles)
            ):
                ServiceBlock.objects.create(
                    image=f"static_kit/website/service_page/blocks/{index + 1}.jpg",
                    title=service_title,
                    text=service_text,
                    service_page=service_page,
                )
        if not TariffPage.objects.exists():
            tariff_page = TariffPage.objects.create(
                title="Тарифи",
                text="Тарифи",
                seo=Seo.objects.create(
                    title="Тарифи", description="Тарифи", keywords="Home24, Тарифи"
                ),
            )

            for index in range(3):
                TariffBlock.objects.create(
                    image=f"static_kit/website/tariff_page/blocks/{index + 1}.jpg",
                    title="Тариф",
                    tariff_page=tariff_page,
                )
        if not AboutPage.objects.exists():
            about_page = AboutPage.objects.create(
                title="Про керуючу компанію",
                text="<p></p><p><b><i><u></u></i></b><b></b>К<i></i><b> омп</b><b><i></i><i></i></b>анія-забудовник не "
                "тільки<i></i>про зі<b></b>здала цей об'єкт для своїх покупців, а й після закінчення "
                "будівництва взяла на себе всі послуги із забезпечення зручного проживання своїх мешканців. Для "
                "Цього була організована керуюча компанія 'Морська симфонія', яка здійснює "
                "комплексне обслуговування комунальної сфери життєдіяльності своїх"
                "Клієнтів.<br></p><p><i>Місією керуючої компанії є така схема взаємодії з "
                "мешканцями будинку, при якому послуги компанії"
                " не відволікають їх від проживання та відпочинку та створюють"
                "максимально комфортну екосистему в будинку. Непомітний сервіс та максимально ефективна робота"
                "є візитною карткою компанії.</i></p><p><br>У функції керуючої компанії входять як "
                "зміст та управління господарством комплексу, так і "
                "охоронюваної прибудинкової території – прибирання,"
                "технічне обслуговування ліфтового господарства, системи електро"
                " та водопостачання будинку, котельні та"
                "пожежна система, диспетчеризація, охорона, утримання прибудинкової території та багато іншого. У "
                "штаті компанії зібрані лише професіонали своєї справи, які допоможуть мешканцям у самих"
                "важких та критичних ситуаціях вирішити їхні житлово-комунальні проблеми сім днів на тиждень"
                "цілодобово - електрики та сантехніки, інженери, монтери та інші фахівці мають"
                "багаторічний досвід та високий рівень кваліфікації.</p><p>Все це робить житловий комплекс "
                "Унікальним, комфортним і безпечним місцем для проживання та відпочинку всієї родини цілий рік."
                "Довірте турботу про ваш будинок і вашу квартиру керуючої компанії і ви зможете круглий"
                "рік насолоджуватися проживанням на березі моря та прекрасною природою Одеси."
                "</p><b></b><br><p></p>",
                photo="static_kit/website/about_page/1.jpg",
                additional_text="<p></p><p>Головним обов'язком керуючої компанії є підтримка комфортних"
                "умов для мешканців, оперативне реагування на їх прохання та побажання</p><p><b>До "
                "додатковим послугам керуючої компанії також належать: 24-годинна охорона"
                "прибудинкової території та паркінгу, прибирання території та вивезення сміття,"
                " обслуговування"
                "Пірса і пляжу. Також за бажання мешканці будинку можуть замовити будь-які"
                "будівельно-ремонтні роботи від штатної бригади компанії</b></p><p></p>",
                additional_title="Про керуючу компанію",
                seo=Seo.objects.create(
                    title="Про нас",
                    description="Про нас",
                    keywords="Home24, Будинок24, Про нас",
                ),
            )
            for index in range(3):
                Document.objects.create(
                    about_page=about_page,
                    file=f"static_kit/website/about_page/documents/{index + 1}.jpg",
                    title=f"photo {index}",
                )
                Gallery.objects.create(
                    about_page=about_page,
                    image=f"static_kit/website/about_page/gallery/{index + 1}.jpg",
                )
                AdditionalGallery.objects.create(
                    about_page=about_page,
                    image=f"static_kit/website/about_page/additional_gallery/{index + 1}.jpg",
                )
